{
  "vietnam": {
    "slug": "vietnam",
    "title": "Vietnam Blog",
    "date": "June 26, 2020",
    "category": "Travel",
    "heroImage": "/assets/images/Vietnam-4.jpeg",
    "sections": [
      {
        "content": [
          "Vietnam has always been described as paradise, add a photographer to this destination and it becomes a dream. A friend decided to move to LA and we wanted to plan a trip one last time. I came across Vietnam while looking for a place that is a cultural hub as well a place that we can lounge at the beach."
        ],
        "images": [
          "/assets/images/Vietnam-4.jpeg"
        ]
      },
      {
        "content": [
          "The trip was planned for 7 days, all the way from the 10th of February to the 17th of February 2020. The impending threat of Covid had already struck and we were closely monitoring the news all the way till we had to fly out. Though Vietnam was not a risk at the time, it became a concern due to China’s border proximity.",
          "What helped our cause was the fact that there were no travel advisories for Vietnam and we flew with Indigo from Mumbai to Kolkata and finally Hanoi. This is the perfect budget destination since returning from Ho Chi Minh to Kolkata and at last Mumbai all in all cost us just 20,000/- per person."
        ],
        "images": [
          "/assets/images/Vietnam-3.jpeg"
        ]
      },
      {
        "content": [
          "The first stop, Hanoi, the capital of Vietnam. Hanoi is known for its centuries-old architecture and rich culture influenced by Southeast Asian, Chinese and French heritage. The streets are jammed with more bikes than cars. Pro tip: Use Grab, it’s a popular ride sharing app and extremely easy to use.",
          "The street food at Hanoi is a must. Try the Vietnamese Pho and egg coffee. By day, explore Hanoi on foot — it’s picturesque and vibrant, especially at night."
        ]
      },
      {
        "content": [
          "Ha Long Bay has been inducted into UNESCO’s list of World Heritage Sites and is famed for its emerald waters and towering limestone cliffs. It’s four hours from Hanoi and offers overnight boat trips. Ha Long Bay’s sunsets are unforgettable.Next, we flew to Phu Quoc, a stunning island in the Gulf of Thailand. Known for white sand beaches and resorts, it’s perfect for relaxation.An absolute must try in Phu Quoc are the burgers at Winston’s Burgers and Beer — some of the best we’ve ever had."
        ],
        "images": [
          "/assets/images/Vietnam-2.jpeg"
        ]
      },
      {
        "content": [
          "Finally, Ho Chi Minh City (formerly Saigon) — a city rich with historical significance from the Vietnam War era. We visited the Cu Chi Tunnels, vital to Viet Cong strategy, and the Mekong River Delta, home to floating markets, Khmer pagodas and rice paddies.",
          "The final day was spent exploring night markets, the Opera House, Central Post Office and the Vietnam War Remnants Museum — a powerful experience. Vietnam was one of the most memorable trips I’ve taken. With Covid restrictions we missed places like Sapa and Da Nang, but I look forward to returning to explore more of its beauty, culture, and food."
        ],
        "images": [
          "/assets/images/Vietnam-1.jpeg"
        ]
      }
    ]
  },
  "bali": {
    "slug": "bali",
    "title": "Bali Blog",
    "date": "December 2023",
    "category": "Travel",
    "heroImage": "/assets/images/Bali-1.jpeg",
    "sections": [
      {
        "content": [
          "Where do I start, I feel like I’m one of the last people to finally get to Bali. I spent so many years watching friends, influencers, strangers online visit Indonesia and thinking now that looks like my kind of place. I don’t know why it took so long to get there!? I guess it’s the fact it’s a very long journey from Ireland and finding a long period of time to escape work was always the hold back.",
          "I’ve travelled a lot of places so when I say this know I say it with full conviction — it was everything I thought it would be and more. I rarely say I would go back somewhere, but I would go back to Bali in a heartbeat, maybe even live there. I would just have to be lathered in factor fifty 24/7."
        ],
        "images": [
          "/assets/images/Bali-6.jpg"
        ]
      },
      {
        "content": [
          "There are multiple airlines that fly to Indonesia, unfortunately there are no direct flights from Ireland. We flew from Dublin to Denpasar via Dubai.Airlines that fly there include Emirates, Qatar, Ethihad, British Airways and Garuda Indonesia.For long haul flights — get the Netflix app and download a full series. I managed to watch the entire series of YOU on the flight home.",
          "We opted for villas for our stay as there was a group of six of us travelling. Hotels just wouldn’t have made sense. Villas in Bali are unbelievable and work out far more economical for longer stays.Security was a concern initially but villas come with 24/7 security and assistance, just like a hotel. And the best part — private pools. I never thought I was a pool-all-day person but Bali proved me very wrong."
        ],
        "images": [
          "/assets/images/Bali-4.jpeg"
        ]
      },
      {
        "content": [
          "We stayed in Villa Ramadewa in Seminyak for 10 days. Arriving at midnight after 17 hours of flying, we were wide awake with excitement. The villa was far bigger than expected and unbelievably clean and modern.It was centrally located, the staff were lovely and the food was exceptional. One thing to note — it’s near a club, so light sleepers should avoid the upstairs room. Our Ubud villa, Kelusa, was out of this world. Split into two buildings, each with its own hanging pool overlooking rice fields and jungle.",
          "We instantly regretted not staying longer. The villa even had a house dog named Puu who somehow always found you for a cuddle. It was the perfect way to end our Bali trip."
        ],
        "images": [
          "/assets/images/Bali-5.jpeg"
        ]
      },
      {
        "content": [
          "For transport, Blue Bird taxi app works well for short trips. For day trips it’s cheaper to hire a driver. Most bookings are done through WhatsApp.I didn’t rent a moped — the road chaos in Seminyak confirmed that decision. Ubud would be more manageable if you do decide to rent one — and always wear a helmet.",
          "Bali has two seasons — wet and dry. We travelled in December during wet season and it honestly wasn’t bad at all. The rain actually helped cool us down.",
          "I packed light layers, silk dresses, Birkenstocks, gym gear, one jumper and good runners. A long sleeve swimsuit was essential to avoid sunburn, and SPF 50 is non-negotiable — I burnt my bum so badly I couldn’t sit for three days.One of the must-do experiences is chasing waterfalls. We visited Sekumpul Waterfall, a two hour drive from Seminyak. After a muddy hike down steep steps, we reached the waterfalls and swam at the base.Standing under a waterfall is one of the most awakening experiences. Pack snacks, water, shoes that can get wet and a towel."
        ],
        "images": [
          "/assets/images/Bali-3.jpeg"
        ]
      },
      {
        "content": [
          "Even if you don’t surf, visit Uluwatu. It’s remote, relaxed and home to some of the best beaches. We surfed with Padang Padang Surf School and had individual instructors.The instructors guide you every step — literally screaming “stand up!”. Be warned, the sun is strong out on the water — layer that SPF.",
          "We took a day trip to Nusa Penida for snorkelling and manta ray searching. Although we didn’t see manta rays, the sea life was incredible.A storm forced us onto mopeds to get back to the beach — the most terrifying and hilarious 20 minutes of my life. It ended up being one of my most memorable Bali moments.",
          "Hiking Mount Batur for sunrise was one of my favourite days. The hike starts in complete darkness and takes around two hours.Watching the pastel sky rise behind the mountains made every step worth it. Do this early in your trip while jet lag is still on your side."
        ],
        "images": [
          "/assets/images/Bali-2.jpeg"
        ]
      }
    ]
  },
  "turkey": {
    "slug": "turkey",
    "title": "Turkey Blog",
    "date": "August 17, 2020",
    "category": "Travel",
    "heroImage": "/assets/images/Turkey-1.jpeg",
    "sections": [
      {
        "content": [
          "I miss Europe’s big sights. But I also miss exploring off the beaten path. And one of the most vivid places for that is in Eastern Turkey.",
          "Even though we’re not visiting Europe right now, I believe a daily dose of travel dreaming can be good medicine. This story comes from my book “For the Love of Europe,” a collection of 100 travel tales.",
          "I’m in Kastamonu, five hours northeast of Ankara. It’s a town that has yet to figure out the business of tourism. My hotel is cheap and comfortable, but not slick.A bank manager invites me for tea — I’m his first American customer. Outside, a funeral procession moves quietly through town. Turkey is a land of ceremonies, where daily life is punctuated with meaningful rituals."
        ],
        "images": [
          "/assets/images/Turkey-2.jpeg"
        ]
      },
      {
        "content": [
          "Driving inland toward Erzurum, life grows harder. Blood feuds still exist, winters are brutal, and villages survive on ducks, dung, and hay.Yet the land surprises you with lush valleys, sun-dried apricots, hazelnuts cracked open with teeth, and shepherd children playing eagle-bone flutes.",
          "Villages welcome us warmly. Hay crowns rooftops for insulation, cow pies are stacked for fuel, and women beat raw wool into future carpets and dowries.This is subsistence living, rich with culture and resilience.",
          "Driving east toward Mount Ararat, the land feels biblical. Ancient lava flows, stark plains, and windswept ridges feel unchanged since Noah’s time. A lone Kurdish man waves from a ridge — a reminder of the unresolved political tensions and humanity beneath the headlines.At sunrise over Mount Ararat, I spot a convoy of Turkish army vehicles. It’s a reminder that the news often misses the human reality.To understand that humanity, you need to travel."
        ],
        "images": [
          "/assets/images/Turkey-3.jpeg"
        ]
      },
      {
        "content": [
          "I was supposed to land in Istanbul today, but instead I’m home — dreaming. Here’s a memory from a past visit. After nearly a decade away, I return to the city where East meets West, wondering what has changed and what remains the same.",
          "Stepping off the plane, I remember how much I love this country. A smiling taxi driver greets me with ‘Merhaba,’ and I reply instinctively, ‘Çok güzel!’. The tangled streets of Sultanahmet buzz with life, just as they always have.",
          "Old dolmuş memories flood back — minibuses once stuffed with passengers, kids yelling destinations through open doors.Turkey has grown more affluent, but the echoes of that chaotic charm still bounce around my memory.",
          "Istanbul today is thriving, home to over 15 million people. A new tunnel beneath the Bosphorus connects Asia and Europe — modern Turkey in concrete form.The city bridges old empires and new ambitions. Crossing the Galata Bridge, I miss the old crusty bridge, but the street life remains — fishermen, bread sellers, water pipes.Cultural inertia is powerful."
        ],
        "images": [
          "/assets/images/Turkey-4.jpeg"
        ]
      },
      {
        "content": [
          "At the Blue Mosque during Ramadan, families gather, prayers echo, and minarets glow. A new carpet replaces the old — order replaces chaos — but the spiritual weight remains. Caught in a surge of worshippers exiting the mosque, I experience a rare moment of shared humanity.",
          "Seagulls wheel through the floodlit minarets — another Istanbul déjà vu.I end my day with sütlaç and a game of backgammon with a stranger — a ritual I began decades ago.Some things change, others never do. Turkey balances progress with tradition."
        ],
        "images": [
          "/assets/images/Turkey-1.jpeg"
        ]
      },
      {
        "content": [
          "Turkey remains one of the most rewarding places I’ve ever traveled. It pushes you out of your comfort zone and into deeper understanding. People-to-people travel matters more than ever."
        ],
        "images": [
          "/assets/images/Turkey-5.jpeg"
        ]
      }
    ]
  }
}